app/Http/Controllers/Website/CompanyController.php

select * from `user_plans` where `company_id` = 1 limit 1
select * from `companies` where `companies`.`id` in (1)
select * from `job_types` where `job_types`.`id` in (2, 3, 4)
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `candidates` inner join `bookmark_company` on `candidates`.`id` = `bookmark_company`.`candidate_id` where `bookmark_company`.`company_id` = 1
---
    public function dashboard()
    {
        try {
            $data['userplan'] = UserPlan::with('plan')
                ->companyData()
                ->firstOrFail();
            $data['openJobCount'] = auth()
                ->user()
                ->company->jobs()
                ->active()
                ->count();
            $data['pendingJobCount'] = auth()
                ->user()
                ->company->jobs()
                ->pending()
                ->count();

            // Recent 4 Jobs
            $data['recentJobs'] = auth()
                ->user()
                ->company->jobs()
                ->latest()
                ->take(4)
                ->with('company.user', 'job_type')
                ->withCount('appliedJobs')
                ->get();
            $data['savedCandidates'] = auth()
                ->user()
                ->company->bookmarkCandidates()
                ->count();

select `id` from `job_types` where `job_types`.`id` in (1, 2, 3, 4, 5)
---
    public function myjobs(Request $request)
    {
        try {
            $query = currentCompany()
                ->jobs()
                ->withCount('appliedJobs')
                ->withoutEdited();

            // status search
            if ($request->has('status') && $request->status != null) {
                $query->where('status', $request->status);
            }

            // status search
            if ($request->has('apply_on') && $request->apply_on != null) {
                $query->where('apply_on', $request->apply_on);
            }

            $myJobs = $query
                ->with('job_type:id')
                ->latest()
                ->paginate(12)
                ->withQueryString();