app/Http/Controllers/Website/WebsiteController.php

    public function candidateApplicationProfileDetails(Request $request)
    {
        try {
            $candidate = User::where('username', $request->username)
                ->with([
                    'contactInfo',
                    'socialInfo',
                    'candidate' => function ($query) {
                        $query->with('experiences', 'educations', 'experience', 'coverLetter', 'education', 'profession', 'languages:id,name', 'skills', 'socialInfo');
                    },
                ])
                ->firstOrFail();
---
select * from `contact_infos` where `contact_infos`.`user_id` in (41)
select * from `education` where `education`.`id` in (2)
select * from `experiences` where `experiences`.`id` in (5)
select * from `professions` where `professions`.`id` in (10)

    public function employersDetails($username)
    {
        try {

            $user = User::where('role', 'company')->where('username', $username)->first();
---
select * from `users` where `role` = 'company' and `username` = 'templatecookie' limit 1