app/helpers.php

select count(*) as aggregate from `companies` where exists (select * from `users` where `companies`.`user_id` = `users`.`id` and `email_verified_at` is not null)
---
    function companies()
    {
        $companies = Company::whereHas('user', function ($query) {
            $query->whereNotNull('email_verified_at');
        })->count();

select count(*) as aggregate from `candidates` where exists (select * from `users` where `candidates`.`user_id` = `users`.`id` and `email_verified_at` is not null)
---
    function candidate()
    {
        $candidates = Candidate::whereHas('user', function ($query) {
            $query->whereNotNull('email_verified_at');
        })->count();

select * from `currencies` where `code` = 'USD' limit 1
---
    function currencyConversion($amount, $to = 'USD', $round = 2)
    {
        // GD: we optimise by caching the currency rate
        $to = strtoupper($to);
        $cacheKey = 'currency_rate_'.$to;
        $rate = Cache::remember($cacheKey, now()->addHours(6), function () use ($to) {
            $currency = Currency::where('code', $to)->first();

select `direction` from `languages` where `code` = 'en' limit 1
---
    function langDirection()
    {
        return currentLanguage()?->direction ?? Language::where('code', config('templatecookie.default_language'))->value('direction');

select * from `seos` where `page_slug` = 'jobs' limit 1
---
    function metaData($page)
    {
        $current_language = currentLanguage() ?: loadDefaultLanguage(); // current language
        $page = Seo::where('page_slug', $page)->first(); // get page

select * from `languages` where `code` = 'en' limit 1
---
    function loadDefaultLanguage()
    {
        return Cache::remember('default_language', now()->addDays(30), function () {
            return Language::where('code', config('templatecookie.default_language'))->first();

select * from `countries` limit 1
---
    function loadCountry()
    {
        return Cache::remember('country', now()->addDays(30), function () {
            return Country::first();

select * from `currencies` where `code` = 'USD' limit 1
---
    function loadSystemCurrency()
    {
        return Cache::remember('systemCurrency', now()->addDays(30), function () {
            // return Modules\Currency\Entities\Currency::where('code', config('jobpilot.currency'))->first();
            return Modules\Currency\Entities\Currency::where('code', config('templatecookie.currency'))->first();

select `code` from `languages` where `code` = 'en' limit 1
---
    function loadSystemLanguageCode()
    {
        return Cache::remember('systemLanguageCode', now()->addDays(30), function () {
            return Language::where('code', config('templatecookie.default_language'))->value('code');

select `status` from `advertisements` where `page_slug` = 'job_detailpage_ad' limit 1
---
    function advertisement_status($page_slug)
    {
        $ad_status = 0;
        $ad_status = Advertisement::where('page_slug', '=', $page_slug)->value('status');

select * from `advertisements`
---
    function loadAdvertisements()
    {
        return Cache::remember('advertisements', now()->addDays(30), function () {
            return Advertisement::all();