app/Http/Controllers/Admin/AdminController.php

select count(*) as aggregate from `users` where `email_verified_at` is not null
select sum(`usd_amount`) as aggregate from `earnings`
select MIN(created_at) AS created_at, sum(usd_amount) as `amount`, DATE_FORMAT(created_at,'%M') as month from `earnings` where `created_at` > '2026-01-01 00:00:00' group by `month` order by `created_at` asc
select * from `companies` where `companies`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14)
select * from `experiences` where `experiences`.`id` in (1, 2, 3, 4, 5, 6, 7, 8)
select * from `job_types` where `job_types`.`id` in (1, 2, 3, 4, 5)
select * from `earnings` order by `created_at` desc limit 10
select * from `plans` where `plans`.`id` in (1, 2, 3)
select `id`, `name` from `manual_payments` where `manual_payments`.`id` in (1, 3, 4)
select `id`, `name`, `email`, `role`, `status`, `email_verified_at`, `created_at`, `image`, `username` from `users` order by `created_at` desc limit 10
---
    public function dashboard()
    {
        session(['layout_mode' => 'left_nav']);
        $jobs = Job::withoutEdited()->get();

        $data['all_jobs'] = $jobs->count();
        $data['active_jobs'] = $jobs->where('status', 'active')->count();
        $data['expire_jobs'] = $jobs->where('status', 'expired')->count();
        $data['pending_jobs'] = $jobs->where('status', 'pending')->count();
        $data['verified_users'] = User::whereNotNull('email_verified_at')->count();
        $data['candidates'] = Candidate::all()->count();
        $data['companies'] = Company::all()->count();
        $data['earnings'] = currencyConversion(Earning::sum('usd_amount'));
        $data['email_verification'] = setting('email_verification');

        $months = Earning::select(
            \DB::raw('MIN(created_at) AS created_at'),
            \DB::raw('sum(usd_amount) as `amount`'),
            \DB::raw("DATE_FORMAT(created_at,'%M') as month")
        )
            ->where('created_at', '>', \Carbon\Carbon::now()->startOfYear())
            ->orderBy('created_at')
            ->groupBy('month')
            ->get();

        $earnings = $this->formatEarnings($months);
        $latest_jobs = Job::withoutEdited()->with(['company', 'job_type', 'experience'])->latest()->get()->take(10);
        $latest_earnings = Earning::with('plan', 'manualPayment:id,name')->latest()->take(10)->get();
        $users = User::select(['id', 'name', 'email', 'role', 'status', 'email_verified_at', 'created_at', 'image', 'username'])->latest()->take(10)->get();